Repository: It4innovations/HEAppE
Catalog: Exceptions/Resources/ExceptionsMessages.*.resx
Languages: cs

# AdaptorUserNotAuthorizedForJobException_UserNotAuthorizedToWorkWithJob
source: Logged user '{0}' is not authorized to query job info '{1}'.
cs: Přihlášený uživatel: '{0}' nemá povolení pracovat s jobem '{1}'.

# AdaptorUserNotAuthorizedForJobException_UserNotAuthorizedToWorkWithTask
source: Logged user '{0}' is not authorized to query task info '{1}'.
cs: Přihlášený uživatel: '{0}' nemá povolení pracovat s taskem '{1}'.

# AdaptorUserGroupException_NoExist
source: None Group does not exist in the HEAppE.
cs: Žádná skupina neexistuje v HEAppE.

# AuthenticationTypeException_OpenStack-UnableToRetrieveCredentials
source: Unable to retrieve OpenStack application credentials for this user.
cs: Nelze získat přihlašovací údaje z OpenStacku pro tohoto uživatele.

# AuthenticationTypeException_NotSupportedAuthentication
source: External authentication method is not implemented.
cs: Externí autentikační metoda není naimplementovaná.

# AuthenticationTypeException_NoUserGroup
source: External authentication: User('{0}') has not User group!
cs: Externí autentikace: Uživatel('{0}') nemá uživatelskou skupinu.

# AuthenticationTypeException_InvalidToken
source: Invalid or not active token provided. Unable to authenticate user by provided credentials.
cs: Poskytnutý token není platný nebo je neaktivní. Nelze ověřit uživatele podle poskytnutých údajů.

# CurrentUsageAndLimitationsException_UsageNotCreated
source: Current usage for user '{0}' and node type '{1}' was not created by the GetCurrentUsageAndLimitationsForUser method.
cs: Aktuální využití pro uživatele '{0}' a ClusterNodeType '{1}' nebylo vytvořeno metodou GetCurrentUsageAndLimitationsForUser.

# FileTransferTemporaryKeyException_PublicKeyMismatch
source: The direct transfer could not be finished due to a public key mismatch.
cs: Přenos nemohl být dokončen kvůli nesouladu veřejného klíče.

# FileTransferTemporaryKeyException_SshKeyGenerationLimit
source: The maximum limit for the number of generated file transfer ssh keys was reached.
cs: Byl dosažen limit generovaných SSH klíčů pro task.

# InputValidationException_CommandTemplateDeleted
source: The specified command template is disabled.
cs: CommandTemplate byla vymazána.

# InputValidationException_CommandTemplateIsGeneric
source: The specified command template is generic.
cs: CommandTemplate je generická.

# InputValidationException_CommandTemplateNoExecutableFile
source: The specified command template does not contain the executable file.
cs: CommandTemplate musí obsahovat spustitelný soubor.

# InputValidationException_CommandTemplateNotGeneric
source: The specified command template is not generic.
cs: CommandTemplate není generická.

# InputValidationException_InvalidPublicKey
source: The specified public key is not valid.
cs: Uvedený veřejný klíč není platný.

# InputValidationException_IPAddressesProvidedOnlyForRunningTask
source: Allocated nodes IP addresses are provided only for running task.
cs: Přidělené IP adresy uzlů jsou k dispozici pouze pro běžící tasky.

# InputValidationException_NoFileOrDirectory
source: No such file or directory.
cs: Soubor nebo složka nebyla nalezena.

# InputValidationException_NoScriptPath
source: The generic command template does not contain the script path.
cs: Generická CommandTemplate musí obsahovat cestu ke skriptu.

# InputValidationException_NotExistingJob
source: Job '{0}' does not exist in the HEAppE.
cs: Job '{0}' neexistuje v HEAppE.

# InputValidationException_NotExistingTask
source: Task '{0}' does not exist in the HEAppE.
cs: Task '{0}' neexistuje v HEAppE.

# InputValidationException_NotValidJobSpecification
source: Submitted job specification is not valid: \r\n {0}
cs: Při zasílání jobu nebyla platná specifikace: \r\n {0}

# InputValidationException_PublicKeyNotFound
source: The specified public key is not defined in the HEAppE.
cs: Uvedený veřejný klíč není definován v HEAppE!

# InvalidRequestException_HPCIdentityNotFound
source: The specified HPC identity is not defined in HEAppE!
cs: Specifikovaný HPC uživatel není definován in HEAppE!

# InputValidationException_SubmittingJobNotInConfiguringState
source: Unable to submit the job (incorrect job state).
cs: Odesílání jobu je k dispozici pouze pro joby ve stavu 'konfigurace'.

# InsufficientRoleException_MissingRoleForProject
source: User does not have '{0}' role for project '{1}'.
cs: Uživatel nemá '{0}' roli v projektu '{1}'.

# InvalidAuthenticationCredentialsException_WrongCredentials
source: Authentication of user '{0}' was not successful.
cs: Autentizace uživatele '{0}' nebyla úspěšná kvůli nesprávným přihlašovacím údajům.

# InvalidRequestException_CannotDeleteJob
source: Cannot delete job '{0}', this job is in state '{1}'.
cs: Nelze smazat task '{0}', task je ve stavu '{1}'.

# InvalidRequestException_ClusterNodeNoReferenceToCluster
source: The specified cluster node has no reference to cluster.
cs: Specifikovaný ClusterNodeType nemá odkaz na žádný cluster.

# InvalidRequestException_NotExistingPath
source: Requested path '{0}' was not found. Exception message: '{1}'.
cs: Neexistuje žádná taková cesta: '{0}'. Zpráva o chybě: '{1}'.

# ClusterAuthenticationException_NotExistingPrivateKeyFile
source: Private key file located at '{0}' does not exist.
cs: Soubor s privátním klíčem umístěný na '{0}' neexistuje.

# InvalidRequestException_NotExistingProject
source: This project does not exist in the HEAppE for selected cluster.
cs: Cluster s tímto projektem neexistuje v HEAppE.

# InvalidRequestException_ParameterIllegalCharacters
source: Parameter '{0}': '{1}' contains illegal characters.
cs: Parametr '{0}': '{1}' obsahuje neplatné znaky.

# InvalidRequestException_ProjectAlreadyExist
source: Project with accounting string '{0}' already exists.
cs: Projekt s account řetězcem '{0}' již existuje.

# InvalidRequestException_ProjectAlreadyExistWithCluster
source: ProjectId '{0}' is already assigned to ClusterId '{1}'.
cs: ProjectId '{0}' je už přiřazen ke ClusterId '{1}'.

# InvalidRequestException_ProjectNoAssignToCluster
source: The ProjectId'{0}' has not been assigned to any cluster.
cs: ProjektId '{0}' není přiřazen k žádnemu clusteru.

# InvalidRequestException_ProjectNoReferenceToCluster
source: ProjectId '{0}' has no reference to ClusterId '{1}'.
cs: ProjektId '{0}' nemá žádný odkaz na ClusterId '{1}'.

# InvalidRequestException_TaskEmptyAttribute
source: '{0}' attribute in the task '{1}' cannot be empty.
cs: '{0}' atribut v Task '{1}' nesmí být prázdný.

# InvalidRequestException_UserNoAccessToClusterNode
source: User '{0}' has no access to ClusterNodeId {1}.
cs: Uživatel '{0}' nemá přístup k ClusterNodeId '{1}'.

# JwtDecodeException_BadAccessTokenFormat
source: Provided access_token is not well formed JWT.
cs: Poskytnutý přístupový token není správně utvořený JWT.

# JwtDecodeException_NotReadableAccessToken
source: Unable to read provided access_token as JWT token.
cs: Neuvedená URL adresa pro autentizaci uživatele podle '{0}'.

# AuthenticationTypeException_OpenId-BadProtocol
source: Other client protocol than 'open-id' connect is not implemented. Please switch the client to 'openid-connect'.
cs: Jiný klientův protokol než 'open-id' není implementován. Přepněte prosím klienta na 'openid-connect'.

# AuthenticationTypeException_OpenId-BadURLForUser
source: Bad URL address for external authentication.
cs: Neuvedená URL adresa pro externí autentizaci.

# AuthenticationTypeException_OpenId-NotInAllowedClientIds
source: User is not in allowed clientIds.
cs: Uživatel není v povolených klientských id.

# AuthenticationTypeException_OpenId-NotVerifiedEmail
source: User does not have a verified email.
cs: Uživatel nemá ověřený e-mail.

# AuthenticationTypeException_OpenId-UserNotActive
source: User account is disabled.
cs: Uživatel není aktivní.

# NotAllowedException_NotAllowedToRequestReport
source: Logged user is not allowed to request this report.
cs: Přihlášený uživatel nemá povolení žádat o tento report.

# AuthenticationTypeException_OpenId-NotSupportedAuthentication
source: Credentials of type '{0}' are not supported for OpenStack authentication.
cs: Ověření typu '{0}' nejsou podporována pro autentizaci k OpenStacku.

# AuthenticationTypeException_OpenStack-MissingCreateCredentialsPermission
source: User does not have permission to create OpenStack credentials for project '{0}'.
cs: Uživatel nemá oprávnění vytvořit přihlašovací údaje OpenStack pro projekt '{0}'.

# AuthenticationTypeException_OpenStack-NoOpenStackProject
source: There is no defined OpenStack project '{0}'.
cs: OpenStack projekt '{0}' není definován.

# AuthenticationTypeException_OpenStack-NotSpecifiedUrl
source: URL address for OpenStack is not specified or valid.
cs: Není uvedená nebo špatně zadaná URL adresa pro OpenStack.

# PbsException_ClusterUsageException
source: Exception thrown when retrieving parameters of queue: '{0}'. Submission script result: '{1}'. Submission script message: '{2}'. Command line for job submission: '{3}'.
cs: Výjimka vyvolána při získávání parametrů fronty: '{0}'. Výsledek skriptu odeslání: '{1}'. Zpráva skriptu odeslání: '{2}'. Příkazový řádek pro odeslání úlohy: '{3}'.

# PbsException_GetActualTasksInfo
source: Exception thrown when retrieving parameters of JobIds: '{0}'. Submission script result: '{1}'. Submission script message: '{2}'. Command line for job submission: '{3}'.
cs: Výjimka vyvolána při získávání parametrů TaskId: '{0}'. Výsledek skriptu odeslání: '{1}'. Zpráva skriptu odeslání: '{2}'. Příkazový řádek pro odeslání úlohy: '{3}'.

# PbsException_GetAllocatedNodesException
source: Exception thrown when retrieving allocation nodes used by running task (HPC job): '{0}'. Submission script result: '{1}'. Submission script message: '{2}'. Command line for job submission: '{3}'.
cs: Výjimka vyvolána při získávání alokovaných cluster nodes používaných běžícím úkolem (HPC Task): '{0}'. Výsledek skriptu odeslání: '{1}'. Zpráva skriptu odeslání: '{2}'. Příkazový řádek pro odeslání úlohy: '{3}'.

# PbsException_SubmitJobException
source: Exception thrown when submitting a job: '{0}' to the cluster: '{1}'. Submission script result: '{2}'. Submission script error message: '{3}'. Command line for job submission: '{4}'.
cs: Výjimka vyvolána při odesílání jobu: '{0}' do clusteru: '{1}'. Výsledek skriptu odeslání: '{2}'. Chybová zpráva skriptu odeslání: '{3}'. Příkazový řádek pro odeslání úlohy: '{4}'.

# PbsException_TaskStateConvertException
source: Task state: '{0}' could not be converted to any known task state.
cs: Stav tasku: '{0}' nelze převést na žádný známý stav úkolu.

# PbsException_UnableToParseResponse
source: Unable to parse response from the scheduler.
cs: Nelze analyzovat odpověď od plánovače PBS Professional.

# RequestedObjectDoesNotExistException_ClusterNodeTypeNotExists
source: Requested cluster node type with Id '{0}' does not exist in the HEAppE.
cs: Požadovaný typ uzlu ClusterId '{0}' neexistuje v HEAppE.

# RequestedObjectDoesNotExistException_ClusterNotExists
source: Requested cluster with Id '{0}' does not exist in the HEAppE.
cs: Požadovaný ClusterId '{0}' neexistuje v HEAppE.

# RequestedObjectDoesNotExistException_ClusterProjectCombinationNoServiceAccount
source: Requested combination for cluster Id '{0}' with Project Id '{1}' has no Service Account Credentials reference in the HEAppE.
cs: Požadovaná kombinace pro ClusterId '{0} a ProjektId'{1}' nemá referenci na pověření služebního účtu v HEAppE.

# RequestedObjectDoesNotExistException_ClusterProjectCombinationNotFound
source: Requested combination for cluster Id '{0}' with Project Id '{1}' has no reference in the HEAppE.
cs: Požadovaná kombinace pro ClusterId '{0}' a ProjektId '{1}' nemá referenci v HEAppE.

# RequestedObjectDoesNotExistException_CommandTemplateNotFound
source: The specified command template is not defined in the HEAppE.
cs: Specifikovaná CommandTemplate s id '{0}' není definována v HEAppE.

# RequestedObjectDoesNotExistException_CommandTemplateNotReferencedToProject
source: Specified CommandTemplateId '{0}' is not referenced to ProjectId '{1}'.
cs: Specifikovaná CommandTemplateId '{0}' není odkazována na ProjectId '{1}'.

# RequestedObjectDoesNotExistException_NotExistingFileTransferMethod
source: Requested FileTransferMethod with Id '{0}' does not exist in the HEAppE.
cs: Požadovaná metoda přenosu souborů s Id '{0}' neexistuje v HEAppE.

# RequestedObjectDoesNotExistException_NotExistingJobInfo
source: Requested job info with Id: '{0}' does not exist in the HEAppE.
cs: Požadované informace o JobId '{0}' neexistují v HEAppE.

# RequestedObjectDoesNotExistException_NotExistingPublicKey
source: The specified public key is not defined in the HEAppE.
cs: Specifikovaný veřejný klíč není definován v HEAppE.

# RequestedObjectDoesNotExistException_NotExistingTaskInfo
source: Requested task info with Id: '{0}' does not exist in the HEAppE
cs: Požadované informace o TaskId '{0}' neexistují v HEAppE.

# RequestedObjectDoesNotExistException_ProjectNotFound
source: The specified project is not defined in the HEAppE.
cs: Specifikovaný projekt není definován v HEAppE.

source: ServiceAccountCredentials is not defined in the HEAppE for this CommandTemplate.
cs: Servisní účet není definován v HEAppE pro tuto CommandTemplate.

# RequestedObjectDoesNotExistException_UserScriptNotDefined
source: The user-script command parameter for the generic Command Template is not defined in the HEAppE.
cs: Parametr příkazu uživatelského skriptu pro generickou CommandTemplate není definován v HEAppE.

# ResourceUsageException_GroupNotSpecified
source: SpecifiedGroupId: '{0}' is not specified in the HEAppE.
cs: Nebyla uvedena specifikovaná Skupina s Id '{0}' v HEAppE.

# ResourceUsageException_JobNotSpecified
source: SpecifiedJobId: '{0}' is not specified in the HEAppE.
cs: Nebyla uvedena specifikovaná TaskId '{0}' v HEAppE.

# ResourceUsageException_ReporterNoAccessToJob
source: This reporter does not have access to report for Job: '{0}'.
cs: Tento typ uživatele nemá přístup k reportu tasku '{0}', protože uživatel nemá přístup k projektu.

# ResourceUsageException_UserNotSpecified
source: SpecifiedUserId: '{0}' is not specified in the HEAppE.
cs: Nebyl uveden specifikovaný uživatel s Id '{0}' v HEAppE.

# SchedulerException_ConvertingError
source: Error occurred when object was converting property type: '{0}' for input data: '{1}' with format: '{2}'.
cs: Při konverzi typu objektu '{0}' pro vstupní data: '{1}' ve formátu: '{2}' došlo k chybě.

# SchedulerException_NotExistingCommandTemplate
source: Command Template '{0}' for task '{1}' is missing in the specification.
cs: CommandTemplate '{0}' pro Task '{1}' neexistuje v konfiguraci adaptéru.

# SchedulerException_NotSupportedEndpoint
source: '{0}' scheduler does not support this endpoint.
cs: Plánovač '{0}' nepodporuje tento bod konektivity.

# SchedulerException_NotValidCommandTemplateParameter
source: Parameter '{0}' in the Command Template '{1}' could not be found either as a property of the task, nor as an additional parameter.
cs: Parametr '{0}' v CommandTemplate '{1}' nelze nalézt ani jako vlastnost tasku, ani jako další parametr.

# SchedulerException_NotValidType
source: Scheduler factory with type '{0}' does not exist.
cs: Faktory plánovače s typem '{0}' neexistují.

# SessionCodeNotValidException_Expired
source: Session code '{0}' already expired at '{1}'.
cs: Kód relace '{0}' již vypršel k '{1}'.

# SessionCodeNotValidException_NotPresent
source: Session code '{0}' is not present in the HEAppE.
cs: Kód relace '{0}' není přítomen v HEAppE.

# SftpClientArgumentException_FactoryManagerTypeNotExists
source: File system manager factory with type '{0}' does not exist.
cs: Faktor správce souborového systému s typem '{0}' neexistuje.

# SftpClientArgumentException_NullArgument
source: Argument '{0}' cannot be null or empty.
cs: Argument '{0}' nesmí být null nebo prázdný.

# SftpClientException_NoAuthenticationSftpClientMethod
source: NoAuthenticationSftpClient does not implement '{0}' method.
cs: NoAuthenticationSftpClient nepodporuje metodu '{0}'!

# SFTPCommandException_NotCorrespondingPasswordForPrivateKey
source: Wrong password for the private key that is used for the connection to '{0}'.
cs: Neodpovídající heslo k privátnímu klíči, který se používá pro připojení k '{0}'!

# SlurmException_ClusterUsageException
source: Exception thrown when retrieving usage of ClusterNode: '{0}'. Submission script result: '{1}'. Submission script message: '{2}'. Command line for queue usage: '{3}'.
cs: Výjimka vyvolána při získávání využití cluster node: '{0}'. Výsledek skriptu odeslání: '{1}'. Zpráva skriptu odeslání: '{2}'. Příkazový řádek pro odeslání úlohy ve frontě: '{3}'.

# SlurmException_GetActualTasksInfo
source: Exception thrown when retrieving parameters of JobIds: '{0}'. Submission script result: '{1}'. Submission script message: '{2}'. Command line for job submission: '{3}'.
cs: Výjimka vyvolána při získávání parametrů TaskId: '{0}'. Výsledek skriptu odeslání: '{1}'. Zpráva skriptu odeslání: '{2}'. Příkazový řádek pro odeslání úlohy: '{3}'.

# SlurmException_GetAllocatedNodesException
source: Exception thrown when retrieving allocation nodes used by running task (HPC job): '{0}'. Submission script result: '{1}'. Submission script message: '{2}'. Command line for job submission: '{3}'.
cs: Výjimka vyvolána při získávání alokovaných cluster nodes používaných běžícím úkolem (HPC Task): '{0}'. Výsledek skriptu odeslání: '{1}'. Zpráva skriptu odeslání: '{2}'. Příkazový řádek pro odeslání úlohy: '{3}'.

# SlurmException_SubmitJobException
source: Exception thrown when submitting a job: '{0}' to the cluster: '{1}'. Submission script result: '{2}'. Submission script error message: '{3}'. Command line for job submission: '{4}'.
cs: Výjimka vyvolána při odesílání Job: '{0}' do clusteru: '{1}'. Výsledek skriptu odeslání: '{2}'. Chybová zpráva skriptu odeslání: '{3}'. Příkazový řádek pro odeslání úlohy: '{4}'.

# SlurmException_UnableToParseNodeUsage
source: Unable to parse cluster node usage from the scheduler.
cs: Nelze analyzovat využití cluster node z plánovače HPC.

# SlurmException_UnableToParseResponse
source: Unable to parse response from the scheduler.
cs: Nelze analyzovat odpověď od plánovače HPC.

# SshClientArgumentException_AuthenticationTypeNotAllowed
source: Selected cluster authentication type is not allowed.
cs: Pověření pro ověření autenticity klientského clusteru není povoleno.

# SshClientArgumentException_NullArgument
source: Argument '{0}' cannot be null or empty.
cs: Argument '{0}' nesmí být null nebo prázdný.

# SshCommandException_CommandException
source: SSH command error: '{0}' Error code: '{1}' SSH command: '{2}'.
cs: Chyba SSH příkazu: '{0}' Chybový kód: '{1}' SSH příkaz: '{2}'.

# SshCommandException_NoIdentities
source: SSH-agent has no identities added.
cs: Ssh-agent nemá přidány žádné identity.

# SshCommandException_NotCorrespondingPasswordForPrivateKey
source: Wrong password for the private key that is used for the connection to '{0}'.
cs: Neodpovídající heslo k privátnímu klíči, který se používá pro připojení k '{0}'.

# UnableToCreateConnectionException_NoActiveConnection
source: TaskId '{0}' with node IP address '{1}' does not have an active connection.
cs: Task '{0}' s IP adresou uzlu: '{1}' nemá aktivní spojení.

# UnableToCreateConnectionException_NotRunningTask
source: TaskId '{0}' is not a currently running task.
cs: TaskId '{0}' není aktuálně běžící úlohou.

# UnableToCreateConnectionException_PortAlreadyInUse
source: TaskId '{0}' with remote node IP address '{1}' already has SSH tunnel for port '{2}'.
cs: TaskId '{0}' s vzdálenou IP adresou uzlu: '{1}' již má SSH tunel pro port: '{2}'.

# UnableToCreateTunnelException_ExceptionOccurs
source: Unable to create SSH tunnel.
cs: Během vytváření SSH tunelu došlo k výjimce.

# UnableToCreateTunnelException_NoActiveTunnel
source: Task '{0}' does not have an active SSH tunnel.
cs: Task '{0}' nemá aktivní SSH tunel.

# UnableToCreateTunnelException_NoFreeLocalPortForSsh
source: There is no free local port available for creation of SSH tunnel.
cs: Neexistuje volný místní port pro vytvoření SSH tunelu.

# InputValidationException_SshKeyAlreadyExists
source: The specified username '{0}' was already used for this project SSH key.
cs: Zadané uživatelské jméno '{0}' již bylo použito pro tento projekt u SSH klíče.

# DbContextException_CredentialsProxyMismatch
source: ClusterAuthenticationCredentialId '{0}' has ClusterProjectCredentials with different ProxyConnection.
cs: ClusterAuthenticationCredentialId '{0}' má ClusterProjectCredentials s jinou ProxyConnection.

# DbContextException_MaxPICount
source: ProjectId '{0}' has more than one PI.
cs: ProjektId '{0}' má více než jedno PI.

# DbContextException_MigrationCountMismatch
source: Application and database migrations counts are not the same. Please update the database.
cs: Počet aplikačních a databázových migrací se neschoduje. Prosím aktualizujte databázi na nejnovější verzi.

# DbContextException_MigrationError
source: Error occured in database migrations.
cs: Během migrace databáze se vyskytla chyba.

# DbContextException_MigrationMismatch
source: Application and database migrations are not the same. Please update the database to the new version.
cs: Aplikační a databázové migrace se neschodují. Prosím aktualizujte databázi na nejnovější verzi.

# DbContextException_NotExistingClusterProjectReference
source: CommandTemplateId '{0}' is referenced to ProjectId '{1}' but in HEAppE does not exist ClusterProject reference.
cs: CommandTemplateId '{0}' je referencován na ProjectId '{1}' ale v HEAppE se reference nenachází.

# DbContextException_NotSupportedSeedEntity
source: Database seed entity '{0}' is not supported.
cs: Databázová seed entita '{0}' je nepodporovaná.

# InputValidationException_NotExistingSubmittedJobInfo
source: SubmittedJobInfoId '{0}' was not found.
cs: SubmittedJobInfoId '{0}' nebylo nalezeno.

# InternalException
source: Problem occured! Contact the administrators.
cs: Nastala neočekávaná výjimka! Kontaktujte administrátora.

# InputValidationException_EnumValueMustBeInInterval
source: '{0}' must have these values '{1}'.
cs: '{0}' musí mít tyto hodnoty '{1}'.

# InputValidationException_EnumValueMustBeSet
source: The '{0}' must be set.
cs: '{0}' musí být nastaven.

# SftpClientException_NotSupportedAuthentication
source: '0' method is not implemented.
cs: '0' metoda není implementována.

# InvalidRequestException_CommandTemplateNotFromGeneric
source: The specified Command Template was not created from Generic Command Template. Unable to use this endpoint.
cs: Zadaný Command Template nebyl vytvořen z generického Command Template.

# InvalidRequestException_CommandTemplateNotStatic
source: The specified Command Template is not static Command Template. Unable to use this endpoint.
cs: Zadaný Command Template nebyl vytvořen jako statický Command Template.

# InputValidationException_CommandTemplateAlreadyParameterExists
source: The specified command template parameter already exists.
cs: Zadaný Command Template již existuje.

# InputValidationException_NotPermitted
source: Operation is not permitted.
cs: Operace není povolená.

# InvalidRequestException_CannotCancelJob
source: Cannot cancel job '{0}', this job is in state '{1}'.
cs: Nelze zrušit job '{0}', job je ve stavu '{1}'.

# InputValidationException_SubProjectDeletedOrEnded
source: Specified SubProject is deleted or not valid.
cs: Specifikovaný SubProject je smazaný nebo neplatný.

# RequestedObjectDoesNotExistException_ProxyConnectionNotFound
source: The specified proxy connection id '{0}' is not defined in the HEAppE.
cs: Specifikovaná proxy connection id '{0}' není definována v HEAppE.
