Repository: It4innovations/HEAppE
Catalog: Exceptions/Resources/ExceptionsMessages.*.resx
Languages: cs

# RequestedObjectDoesNotExistException_ClusterNodeTypeAggregationNotFound
source: The specified cluster node type aggregation id '{0}' is not defined in the HEAppE.
cs: Specifikovaný cluster node type aggregation id '{0}' není definován v HEAppE.

# RequestedObjectDoesNotExistException_FileTransferMethodNotFound
source: The specified file transfer method id '{0}' is not defined in the HEAppE.
cs: Specifikovaná file transfer metóda s id '{0}' není definována v HEAppE.

# RequestedObjectDoesNotExistException_ClusterProxyConnectionNotExists
source: Requested cluster proxy connection with Id '{0}' does not exist in the HEAppE.
cs: Požadovaná cluster proxy connection s id '{0}' není definována v HEAppE.

# InvalidRequestException_ClusterNodeTypeAggregationAccountingAlreadyExists
source: The specified cluster node type aggregation accounting with clusterNodeTypeAggregationId '{0}' and accountingId '{1}' already exists in the HEAppE.
cs: Cluster node type aggregation accounting s clusterNodeTypeAggregationId '{0}' a accountingId '{1}' je již definován v HEAppE.

# RequestedObjectDoesNotExistException_AccountingNotFound
source: The specified accounting with Id '{0}' is not defined in the HEAppE.
cs: Požadovaný accounting s Id '{0}' není definován v HEAppE.

source: The specified cluster node type aggregation accounting with clusterNodeTypeAggregationId '{0}' and accountingId '{1}' is not defined in the HEAppE.
cs: Požadovaný cluster node type aggregation accounting s clusterNodeTypeAggregationId '{0}' a accountingId '{1}' není definován v HEAppE.

# InvalidRequestException_ProjectClusterNodeTypeAggregationAlreadyExists
source: Project cluster node type aggregation with ProjectId '{0}' and ClusterNodeTypeAggregationId '{1}' already exists HEAppE.
cs: Project cluster node type aggregation s ProjectId '{0}' a ClusterNodeTypeAggregationId '{1}' je již definován v HEAppE.

# RequestedObjectDoesNotExistException_ProjectClusterNodeTypeAggregationNotFound
source: Requested combination for ProjectId '{0}' with ClusterNodeTypeAggregationId '{1}' has no reference in the HEAppE.
cs: Požadovaná kombinace pro ProjectId '{0}' a ClusterNodeTypeAggregationId '{1}' nemá referenci v HEAppE.

# RequestedObjectDoesNotExistException_CommandTemplateParameterNotFound
source: The specified command template parameter with id '{0}' is not defined in the HEAppE.
cs: Specifikovaný CommandTemplate parameter s id '{0}' není definován v HEAppE.

# InputValidationException_SubProjectIdentifierAlreadyExists
source: Specified SubProject identifier already exists.
cs: Specifikovaný identifikátor subprojektu již existuje.

# SshClientArgumentException_UnknownPrivateKeyException
source: Failed to read private key.
cs: Nepodařilo se načíst privátní klíč.

# InputValidationException_GitCloneCommandError
source: Exception thrown when cloning git repository.
cs: Výjimka vyvolána při klonování git repositáře.

# DatabaseBackupException_BackupTransactionLogsCantBeDone
source: Database transaction logs backup can't be done. There needs to exist full backup and database need to be in 'FULL' or 'BULK_LOGGED' recovery model.
cs: Záloha transakčních logů databáze nemůže být provedena. Musí existovat úplná záloha a databáze musí být v režimu obnovení ‚FULL‘ nebo ‚BULK_LOGGED‘.

# DatabaseBackupException_FullBackupCantBeDone
source: Database full backup can't be done. Database needs to be in 'FULL' or 'BULK_LOGGED' recovery model.
cs: Úplná záloha databáze nemůže být provedena. Databáze musí být v režimu obnovení ‚FULL‘ nebo ‚BULK_LOGGED‘.

# DatabaseBackupException_FullBackupException
source: An exception occured during execution of the full database backup.
cs: Při provádění úplné zálohy databáze došlo k výjimce.

# DatabaseBackupException_TransactionLogsBackupException
source: An exception occured during execution of the transaction logs backup.
cs: Při provádění zálohy transakčních logů došlo k výjimce.
